0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    side
    {
        type            noSlip;
    }

    atmosphere
    {
	type		inletOutlet;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);

    }
    atmosphere2
    {
        type            inletOutlet;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);
    }
}


// ************************************************************************* //
