system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-0.2378743896484375 -0.17547782897949218 -0.8695864715576173)
  (0.23787324523925782 -0.17547782897949218 -0.8695864715576173)
  (0.23787324523925782 0.2995598297119141 -0.8695864715576173)
  (-0.2378743896484375 0.2995598297119141 -0.8695864715576173)
  (-0.2378743896484375 -0.17547782897949218 0.08838257217407226)
  (0.23787324523925782 -0.17547782897949218 0.08838257217407226)
  (0.23787324523925782 0.2995598297119141 0.08838257217407226)
  (-0.2378743896484375 0.2995598297119141 0.08838257217407226)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (80 80 160) simpleGrading (1 1 1)
);
defaultPatch
{
  type patch;
}
boundary ();
